{
  "jobs": [
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:23",
      "sourced": "public domain",
      "unique": 1388104,
      "companyName": "Evans",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Full Stack Developer",
      "description": "<p><strong>Primary Role:</strong></p><p>Supporting the development and improvement of business applications through programming and system design, developing queries to run reports, and linking various business systems and allowing the business to leverage the data in those systems.</p><p><br /></p><p><strong>Key Responsibilities: </strong></p><ul><li>Developing new systems, applications and reports supporting business processes in key areas such as sales automation, engineering, manufacturing and finance</li><li>Understanding and mapping business processes in across all department organizations in order to develop tools to support efficient use of these processes</li><li>Monitors, maintains, and upgrades applicable technology systems in assigned area of responsibility, which includes quality assurance, problem solving, researching user issues, performing upgrades and maintenance, and implementing system modifications.</li><li>Create and maintain new reports and web based dashboards as required, providing users with the information they require to drive forward Continuous Improvement initiatives across the business</li><li>Provide data processing support as required, including activities such as data cleaning, data enrichment and data entry.</li><li>Writes and maintains user report programs based on the needs of internal customers.</li><li>Supports, troubleshoots, and upgrades applicable system infrastructures.</li><li>Other tasks as assigned by management</li></ul><p><br /></p><p><strong>Education/Experience</strong></p><ul><li>Diploma or Degree in Computer Science, Information Technology, Computer Information Systems, or a related field. Relevant experience may substitute for the degree requirement for 5+ years.</li><li>Five years of hands-on experience in software analysis, design, and development, including one year of lead or supervisory experience.</li><li>Strong business process experience (required)</li><li>Strong programming experience at a minimum with JavaScript frameworks, C# .NET, SQL, ThreeJS, and Angular (required). </li><li>Knowledge of systems, database and web design.</li><li>Experience in using various programming languages.</li></ul>",
      "link": "https://zobjobs.com/job/full-stack-developer-web-job-in-canada-zj6qev4tfa8h",
      "category": [
        "Web",
        "Full Stack Developer",
        "Javascript"
      ],
      "location": "Calgary AB Alberta CA",
      "country": "CA"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:19",
      "sourced": "public domain",
      "unique": 1388103,
      "companyName": "Empower",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Senior Web Engineer",
      "description": "Grow your career with a growing organization<br><br>Whether theyre helping people reach their long-term financial goals or providing personal wealth management strategies, every associate contributes to changing the lives of those we serve for the better. When it comes to job satisfaction, thats hard to beat. And from a personal satisfaction perspective, youll enjoy the freedom to support causes that matter to you and experience a truly inclusive work environment. Your future starts now.<br><br>Continue to build your rewarding career helping others achieve their financial dream at an organization that values your own long-term success. With your unique talents, you have what it takes to be bold and brilliant in everything you do and reach new heights for a company dedicated to diversity and inclusion, community and you.<br><br>As a Front-End Developer you will be involved in all stages of the project lifecycle from requirements to development, to implementation in production environments. This position is very hands-on and requires a strong ability to adapt to challenging problems and an intense desire to work as part of a cohesive team. All team members are expected to keep abreast of the latest industry trends, technologies, and frameworks and to display industry competitive skills and techniques. We have a very knowledgeable group of professionals who work in an energized positive team environment.<br><br>What will you do:<br>• Develop rich client UI applications with JavaScript and libraries like AngularJS, React, jQuery and Bootstrap that utilize RESTful Java back-end web services.<br>• Construct, comment, unit test, and end-to-end test user interface programs, modules and components of medium complexity.<br>• Work with and develop client programs, classes and sub-systems of medium complexity.<br>• Maintain and support existing user interface applications of medium complexity.<br>• Work with Business Analysts to ensure that technical design and programs satisfy business needs.<br>• Contribute to peer UI code evaluations.<br>• Implement quality assurance standards for development activities within assigned projects.<br>• Other duties as assigned.<br><br>What will you bring:<br>• 6+ years of experience in JavaScript and HTML5 / CSS3 with at least three years on the front-end.<br>• Demonstrable experience building world-class, consumer web application interfaces .<br>• Ability to write high-performance, reusable code for UI components.<br>• Strong knowledge of JavaScript fundamentals and ES6.<br>• Strong command of web standards, HTML, CSS, cross-browser compatibility, and accessibility.<br>• Experience working with modern front-end tools such as React.js, Webpack, Enzyme, and Jest.<br>• Experiencing writing unit tests for UI components using technologies like Jest, Chai, Mocha, react testing library and end-to-end testing using Selenium.<br>• Working experience with browser APIs, and passion for optimizing front end performance.<br>• Knowledge of client-side visualization libraries such as D3 is a bonus.<br>• Experience with A/B testing and optimization is a plus.<br>• Strong analytical and problem-solving skills.<br>• Do it all attitude!<br><br>What will set you apart:<br>• Bachelors degree in Computer Science , Information Systems, or equivalent emphasis.<br>• Any experience with web service development and AWS architecture.<br>• Experience with Git, Java, Maven, and or Hudson/Jenkins are a plus.<br><br>Applicants must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment visa at this time, including CPT/OPT.<br><br>What we offer you<br><br>We offer an array of diverse and inclusive benefits regardless of where you are in your career. We believe that providing our employees with the means to lead healthy balanced lives results in the best possible work performance.<br>• Medical, dental, vision and life insurance<br>• Retirement savings - 401(k) plan with generous company matching contributions (up to 6%), financial advisory services, potential company discretionary contribution, and a broad investment lineup<br>• Tuition reimbursement up to $5,250/year<br>• Business-casual environment that includes the option to wear jeans<br>• Generous paid time off upon hire - including a paid time off program plus ten paid company holidays and three floating holidays each calendar year<br>• Paid volunteer time - 16 hours per calendar year<br>• Leave of absence programs - including paid parental leave, paid short- and long-term disability, and Family and Medical Leave (FMLA)<br>• Business Resource Groups (BRGs) - internal networks that rally around common interest, experiences and identities such as race, ethnicity, gender, ability, military status and sexual orientation. BRGs play a vital role in educating and engaging our people and advancing our business priorities.<br><br>Base Salary Range<br><br>$101,600.00 - $143,525.00<br>The salary range above shows the typical minimum to maximum base salary range for this position in the location listed. Non-sales positions have the opportunity to participate in a bonus program. Sales positions are eligible for sales incentives, and in some instances a bonus plan, whereby total compensation may far exceed base salary depending on individual performance. Actual compensation offered may vary from posted hiring range based upon geographic location, work experience, education, licensure requirements and/or skill level and will be finalized at the time of offer.<br><br>Equal opportunity employer • Drug-free workplace<br><br>We are an equal opportunity employer with a commitment to diversity. All individuals, regardless of personal characteristics, are encouraged to apply. All qualified applicants will receive consideration for employment without regard to age (40 and over), race, color, national origin, ancestry, sex, sexual orientation, gender, gender identity, gender expression, marital status, pregnancy, religion, physical or mental disability, military or veteran status, genetic information, or any other status protected by applicable state or local law.<br><br>For remote and hybrid positions you will be required to provide reliable high-speed internet with a wired connection as well as a place in your home to work with limited disruption. You must have reliable connectivity from an internet service provider that is fiber, cable or DSL internet. Other necessary computer equipment, will be provided. You may be required to work in the office if you do not have an adequate home work environment and the required internet connection.<br><br>Job Posting End Date:<br><br>02-16-2024<br>Want the latest money news and views shaping how we live, work and play? Sign up for Empowers free newsletter and check out The Currency .<br><br>Workplace Flexibility: Remote - Nationwide",
      "link": "https://zobjobs.com/job/senior-web-engineer-html-job-in-usa-zj6qev4t344q",
      "category": [
        "HTML"
      ],
      "location": "United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:19",
      "sourced": "public domain",
      "unique": 1388102,
      "companyName": "Spatial Front, Inc",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Junior Front-End Developer (Angular)",
      "description": "Job Type<br><br>Full-time<br><br>Description<br><br>SFI is responsible for Front-End Development support for a federal agency. Spatial Front, Inc. is seeking an experienced Jr. Front-End Developer to join our team based out of Washington, DC. The Jr. Front-End Developer designs, develops, tests and integrates custom Web applications and solutions interfacing with backend services.<br><br>Although the position is mostly remote, there is a possibility of on-site work in the DC Metro area.<br><br>Responsibilities<br>• Design, develop, test and integrate of custom Web applications and solutions interfacing with backend services.<br>• Develop a cloud-based web application<br>• Interfaces with senior-level customer management and SMEs<br>• Develop scalable, secure, cross-platform web applications.<br>• Resolve complex design, implementation and/or performance issues.<br>• Optimize web pages for maximum speed and scalability.<br>• Develop front end applications using HTML/CSS/JavaScript, and other front end development frameworks such as Angular<br>• Work with a development team for the development of both front-end web application and back-end services, assist back-end developers with coding and troubleshooting<br>• Support all development and delivery activities, from requirements definition and specification to deployment and delivery to production.<br>• Consult with project teams and end users to identify new requirements; identifies areas for improvement<br><br>Requirements<br>• Bachelor’s degree in computer science or a related field, or substitute eight years of equivalent work experience.<br>• 1-2 years of recent hands-on front end development experience, using HTML5/CSS3, SASS, JavaScript, Bootstrap.<br>• 1-2 years of experiences using Angular framework<br>• 1-2 years of Web application, SOA, web service (SOAP or RESTful) development and deployment<br>• Experience in Cloud application development preferred.<br>• Experience using relational databases preferred.<br>• Experience with unit testing preferred.<br>• Experience in developing innovative scalable, secure, cross-platform enterprise custom applications<br>• Strong interpersonal communication skills to establish and maintain an effective working relationship with development teams and customers<br><br>Strongly Preferred<br>• Some experience in Azure cloud<br>• SQL Server relational database design and development<br><br>Desired Skills<br>• Experience in applying Agile/Scrum methodology<br>• Experience leading multiple concurrent software development projects<br>• Strong interpersonal communication skills to establish and maintain an effective working relationship with development teams and customers<br><br>Preferred but not required experience: .NET Core<br><br>Additional Information<br>• In order to meet the clearance requirements for this opportunity, candidates must be authorized to work in the US.<br>• All candidates will be subject to a complete background check to include, but not limited to Criminal History, Education Verification, Professional Certification Verification, Verification of Previous Employment and Credit History.<br>• Public Trust background investigations can take approximately four to eight weeks and requires fingerprinting.<br><br>Other Information<br>• The salary for this position is $80,000 - $100,000 annually<br>• For information on SFIs benefits please visit http://www.spatialfront.com/pages/career.html<br>• This is a full-time W2 position.<br>• Please no agencies, third parties, or corp-to-corp.<br>• Spatial Front Inc. is an Equal-opportunity Employer, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<br>• Spatial Front Inc. participates in E-Verify.<br><br>Salary Description<br><br>$80,000-$100,000 Based on Experience",
      "link": "https://zobjobs.com/job/junior-frontend-developer-angular-html-job-in-usa-zj6qev4t2l47",
      "category": [
        "HTML"
      ],
      "location": "United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:19",
      "sourced": "public domain",
      "unique": 1388101,
      "companyName": "The Coleman Group, Inc.",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Senior Web Developer",
      "description": "Essential Functions:The Senior Web Developer (SWD)willdevelop websites per user requirements using the Cascade Server Web Content Management System and HTML, XML, CSS, JavaScript, jQuery, Python, and other technologies as assigned.The SWD will develop, test, and maintain database-driven web applications per user requirements using PHP and MySQL and other technologies as assigned.Duties Include:Senior Website Developer will produce standards-compliant, accessible (i.e., Section 508 compliant), cross-browser (IE, Chrome, Firefox, and Safari), and gracefully-degrading code.Manage web development or design projects through all phases from user requirements gathering, wireframing, design, testing, training, and implementation.Diagnose and resolve programming problems and issues with websites and web applications.Gather, analyze, and document customer functional requirements as well as translate and interpret functional requirements into database designs and applicationprototypes.Identify security risks and determine and develop solutions including cyber vulnerability detection and assessment; incident handling and malware/vulnerability analysis and cyber incident response.Establish a good rapport and effectively communicate with customers, coworkers and supervisors, both verbally and in writing.Provide training and support of user communities with Web technologies andtools.Act as primary or backup application administrator for other web-based applications as assigned such as Cascade Server and Ungerboeck Event ManagementSystem. (Might not find many candidates familiar with this technology)Follow-up communications such as the closing out of trouble tickets, preparing incident reports, sending emails, and/or providing verbal or written status will be an intrinsic part of the work.Senior Web Developer Activities include :Written/Oral Reports (as required).Project Management Documentation (as required). Scope document and Plan of Action and Milestones (POA&M) outlining schedule and delivery dates for specific task(s).Application Administration Documentation (as required). In electronic form using MS Word or Google Docs for all application administration and related support work completed supporting the program.Functional and Accurate Websites and Web applications (as required). If a task involves the creation or updating of a website or web application, the website should conform with web standards, contain accurate information, and meet the user requirements.System Documentation (as required). Complete systems documentation, user manuals, test plans, etc. for all information technology systems developed under the program.Obtaining and maintaining a public trust clearanceObtaining and maintaining Security + Certification.Other duties as assigned.Senior Website Developer Qualifications:Education:Bachelors degree required.At least five years of professional experience and familiarity with the majority of the skills listedbelow:CriticalSkills:Web Design - Programming with HTML, XML, CSS, JavaScript andjQueryResponsive design - Creating sites which are properly formatted and configured for mobile devices using responsive design.Web application development - Developing, testing and maintaining database-driven web applications using PHP and MySQL. Experience with ASP, PERL and applications utilizing Oracle databases is a plus.Accessibility - Producing standards-compliant, accessible (i.e., Section 508 compatible), cross-browser (IE, Chrome, Firefox, and Safari), and gracefully-degrading code.Project management - Project management skills to efficiently manage a web development or design project through all phases from user requirements gathering, wireframing, design, testing, training, andimplementation.Troubleshooting and debugging - Diagnosing and resolving complex programming problems and issues.Functional requirements - Gathering, analyzing, and documenting customer functional requirements. Translating and interpreting functional requirements into database designs and application prototypes.Cybersecurity - Knowledge and skill in identifying security risks and determining and developing solutions including cyber vulnerability detection and assessment; incident handling and malware/vulnerability analysis and cyber incident response.Customer service - Ability to establish a good rapport and effectively communicate with customers, coworkers, and supervisors, both verbally and in writing.Training - Ability to provide training and support of user communities with Web technologies and tools.AdditionalSkills:Experience with Apache web server administration in a UNIX or Linux environment. Experience with Microsoft Internet Information Services (IIS) is a plus and Windows ServerUnderstanding relational database concepts and Structured Query Language(SQL).Understanding of UNIX or Linux commands, particularly related to Apache web serveradministration.Troubleshooting basic shell scripts andprograms.Utilizing web analytics to produce detailed and informative analytics reports anddashboards.Search engine optimization techniques to ensure that all websites are optimized for maximum search engine visibility.Graphics design and multimedia, preferably in Adobe Photoshop orFireworks.Web content management systems (CMS) experience (preferably Cascade Server), including the development of CMS template sites.Senior Web Developer Reports to:The Coleman Group’s Project ManagerLocation:Onsite inAnnapolis, MD, with eligibility for a Hybrid-Remote schedule(8-hourshift).Flexible Daily Start Time Available.Monday to FridayBenefits:Eligible for a Hybrid Remote ScheduleFlexible Daily Start Time AvailableProfit Sharing401(k) matchingHealth insuranceDental insuranceVision insurancePaid time offHealthcare Spending Account (HSA)Cybersecurity/Identity Theft Protection (Norton LifeLock)Employee DiscountsProfessional development opportunities, e.g. Salesforce certificationsJob Type:Full TimeClassification: Exempt PositionThe Coleman Group, Inc. is an equal opportunity employer and will not discriminate against any applicant for employment based on race, color, religion, national origin, gender, gender identity or expression, sexual orientation, disability or veteran status, political affiliation, or on any other basis prohibited by law.EEO/E-Verifyemployer.The Coleman Group, Inc. is an equal opportunity employer and will not discriminate against any applicant for employment based on race, color, religion, national origin, gender, gender identity or expression, sexual orientation, disability or veteran status, political affiliation, or on any other basis prohibited by law.Reasonable accommodations are available to persons with disabilities during application and/or interview processes per the Americans with Disabilities Act. For accommodation requests or assistance with this form, contact The Coleman Group HR at 301-794-4914 or humanresourceshire@colemangroupinc.com.Powered by JazzHRPI86a356339822-35216-33336007",
      "link": "https://zobjobs.com/job/senior-web-developer-html-job-in-usa-zj6qev4t2kg2",
      "category": [
        "HTML",
        "Website"
      ],
      "location": "United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:16",
      "sourced": "public domain",
      "unique": 1388100,
      "companyName": "Spatial Front",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Junior Front-End Developer (Angular)",
      "description": "Job Type\n\nFull-time\n\nDescription\n\nSFI is responsible for Front-End Development support for a federal agency. Spatial Front, Inc. is seeking an experienced Jr. Front-End Developer to join our team based out of Washington, DC. The Jr. Front-End Developer designs, develops, tests and integrates custom Web applications and solutions interfacing with backend services.\n\nAlthough the position is mostly remote, there is a possibility of on-site work in the DC Metro area.\n\nResponsibilities\n\n• Design, develop, test and integrate of custom Web applications and solutions interfacing with backend services.\n• Develop a cloud-based web application\n• Interfaces with senior-level customer management and SMEs\n• Develop scalable, secure, cross-platform web applications.\n• Resolve complex design, implementation and/or performance issues.\n• Optimize web pages for maximum speed and scalability.\n• Develop front end applications using HTML/CSS/JavaScript, and other front end development frameworks such as Angular\n• Work with a development team for the development of both front-end web application and back-end services, assist back-end developers with coding and troubleshooting\n• Support all development and delivery activities, from requirements definition and specification to deployment and delivery to production.\n• Consult with project teams and end users to identify new requirements; identifies areas for improvement\n\n\n\nRequirements\n\n• Bachelor’s degree in computer science or a related field, or substitute eight years of equivalent work experience.\n• 1-2 years of recent hands-on front end development experience, using HTML5/CSS3, SASS, JavaScript, Bootstrap.\n• 1-2 years of experiences using Angular framework\n• 1-2 years of Web application, SOA, web service (SOAP or RESTful) development and deployment\n• Experience in Cloud application development preferred.\n• Experience using relational databases preferred.\n• Experience with unit testing preferred.\n• Experience in developing innovative scalable, secure, cross-platform enterprise custom applications\n• Strong interpersonal communication skills to establish and maintain an effective working relationship with development teams and customers\n\n\n\nStrongly Preferred\n\n• Some experience in Azure cloud\n• SQL Server relational database design and development\n\n\n\nDesired Skills\n\n• Experience in applying Agile/Scrum methodology\n• Experience leading multiple concurrent software development projects\n• Strong interpersonal communication skills to establish and maintain an effective working relationship with development teams and customers\n\n\n\nPreferred but not required experience: .NET Core\n\nAdditional Information\n\n• In order to meet the clearance requirements for this opportunity, candidates must be authorized to work in the US.\n• All candidates will be subject to a complete background check to include, but not limited to Criminal History, Education Verification, Professional Certification Verification, Verification of Previous Employment and Credit History.\n• Public Trust background investigations can take approximately four to eight weeks and requires fingerprinting.\n\n\n\nOther Information\n\n• The salary for this position is $80,000 - $100,000 annually\n• For information on SFI's benefits please visit http://www.spatialfront.com/pages/career.html\n• This is a full-time W2 position.\n• Please no agencies, third parties, or corp-to-corp.\n• Spatial Front Inc. is an Equal-opportunity Employer, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n• Spatial Front Inc. participates in E-Verify.\n\n\n\nSalary Description\n\n$80,000-$100,000 Based on Experience",
      "link": "https://zobjobs.com/job/junior-frontend-developer-angular-html-job-in-usa-zj6qev4sqd2k",
      "category": [
        "HTML"
      ],
      "location": "Washington DC US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:16",
      "sourced": "public domain",
      "unique": 1388099,
      "companyName": "The Coleman Group, Inc.",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Senior Web Developer",
      "description": "Essential Functions:The Senior Web Developer (SWD)willdevelop websites per user requirements using the Cascade Server Web Content Management System and HTML, XML, CSS, JavaScript, jQuery, Python, and other technologies as assigned.The SWD will develop, test, and maintain database-driven web applications per user requirements using PHP and MySQL and other technologies as assigned.Duties Include:Senior Website Developer will produce standards-compliant, accessible (i.e., Section 508 compliant), cross-browser (IE, Chrome, Firefox, and Safari), and gracefully-degrading code.Manage web development or design projects through all phases from user requirements gathering, wireframing, design, testing, training, and implementation.Diagnose and resolve programming problems and issues with websites and web applications.Gather, analyze, and document customer functional requirements as well as translate and interpret functional requirements into database designs and applicationprototypes.Identify security risks and determine and develop solutions including cyber vulnerability detection and assessment; incident handling and malware/vulnerability analysis and cyber incident response.Establish a good rapport and effectively communicate with customers, coworkers and supervisors, both verbally and in writing.Provide training and support of user communities with Web technologies andtools.Act as primary or backup application administrator for other web-based applications as assigned such as Cascade Server and Ungerboeck Event ManagementSystem. (Might not find many candidates familiar with this technology)Follow-up communications such as the closing out of trouble tickets, preparing incident reports, sending emails, and/or providing verbal or written status will be an intrinsic part of the work.Senior Web Developer Activities include :Written/Oral Reports (as required).Project Management Documentation (as required). Scope document and Plan of Action and Milestones (POA&M) outlining schedule and delivery dates for specific task(s).Application Administration Documentation (as required). In electronic form using MS Word or Google Docs for all application administration and related support work completed supporting the program.Functional and Accurate Websites and Web applications (as required). If a task involves the creation or updating of a website or web application, the website should conform with web standards, contain accurate information, and meet the user requirements.System Documentation (as required). Complete systems documentation, user manuals, test plans, etc. for all information technology systems developed under the program.Obtaining and maintaining a public trust clearanceObtaining and maintaining Security + Certification.Other duties as assigned.Senior Website Developer Qualifications:Education:Bachelor's degree required.At least five years of professional experience and familiarity with the majority of the skills listedbelow:CriticalSkills:Web Design - Programming with HTML, XML, CSS, JavaScript andjQueryResponsive design - Creating sites which are properly formatted and configured for mobile devices using responsive design.Web application development - Developing, testing and maintaining database-driven web applications using PHP and MySQL. Experience with ASP, PERL and applications utilizing Oracle databases is a plus.Accessibility - Producing standards-compliant, accessible (i.e., Section 508 compatible), cross-browser (IE, Chrome, Firefox, and Safari), and gracefully-degrading code.Project management - Project management skills to efficiently manage a web development or design project through all phases from user requirements gathering, wireframing, design, testing, training, andimplementation.Troubleshooting and debugging - Diagnosing and resolving complex programming problems and issues.Functional requirements - Gathering, analyzing, and documenting customer functional requirements. Translating and interpreting functional requirements into database designs and application prototypes.Cybersecurity - Knowledge and skill in identifying security risks and determining and developing solutions including cyber vulnerability detection and assessment; incident handling and malware/vulnerability analysis and cyber incident response.Customer service - Ability to establish a good rapport and effectively communicate with customers, coworkers, and supervisors, both verbally and in writing.Training - Ability to provide training and support of user communities with Web technologies and tools.AdditionalSkills:Experience with Apache web server administration in a UNIX or Linux environment. Experience with Microsoft Internet Information Services (IIS) is a plus and Windows ServerUnderstanding relational database concepts and Structured Query Language(SQL).Understanding of UNIX or Linux commands, particularly related to Apache web serveradministration.Troubleshooting basic shell scripts andprograms.Utilizing web analytics to produce detailed and informative analytics reports anddashboards.Search engine optimization techniques to ensure that all websites are optimized for maximum search engine visibility.Graphics design and multimedia, preferably in Adobe Photoshop orFireworks.Web content management systems (CMS) experience (preferably Cascade Server), including the development of CMS template sites.Senior Web Developer Reports to:The Coleman Group’s Project ManagerLocation:Onsite inAnnapolis, MD, with eligibility for a Hybrid-Remote schedule(8-hourshift).Flexible Daily Start Time Available.Monday to FridayBenefits:Eligible for a Hybrid Remote ScheduleFlexible Daily Start Time AvailableProfit Sharing401(k) matchingHealth insuranceDental insuranceVision insurancePaid time offHealthcare Spending Account (HSA)Cybersecurity/Identity Theft Protection (Norton LifeLock)Employee DiscountsProfessional development opportunities, e.g. Salesforce certificationsJob Type:Full TimeClassification: Exempt PositionThe Coleman Group, Inc. is an equal opportunity employer and will not discriminate against any applicant for employment based on race, color, religion, national origin, gender, gender identity or expression, sexual orientation, disability or veteran status, political affiliation, or on any other basis prohibited by law.EEO/E-Verifyemployer.The Coleman Group, Inc. is an equal opportunity employer and will not discriminate against any applicant for employment based on race, color, religion, national origin, gender, gender identity or expression, sexual orientation, disability or veteran status, political affiliation, or on any other basis prohibited by law.Reasonable accommodations are available to persons with disabilities during application and/or interview processes per the Americans with Disabilities Act. For accommodation requests or assistance with this form, contact The Coleman Group HR at 301-794-4914 or humanresourceshire@colemangroupinc.com.Powered by JazzHRPI86a356339822-35216-33336007",
      "link": "https://zobjobs.com/job/senior-web-developer-html-job-in-usa-zj6qev4sq31t",
      "category": [
        "HTML",
        "Website"
      ],
      "location": "Remote US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:12",
      "sourced": "public domain",
      "unique": 1388098,
      "companyName": "Mywish Marketplaces Private Limited",
      "companyUrl": "https://zobjobs.com/company/mywish-marketplaces-private-limited",
      "title": "Python Developer",
      "description": "Python Developer Job PostedDate: 30/Jan/2024 Reports to<br><br>Technical Lead<br>Overview<br><br>Wishfin is one of the top fintech platforms in India. We are looking to onboard a Python Engineer. We are looking for a Python Developer to be part of a highly collaborative, quality focused, agile team. You should be comfortable working in a fast-paced, flexible environment where communication is essential.<br><br>Key Responsibilities<br><br>• A clear understanding of product development environments and methodologies like Agile, MySQL, NoSQL databases like MongoDB and Redis.<br><br>• Excellent Knowledge of database technologies and SQL Optimization Database Analysis and Optimization skills<br><br>• Writing elegant, reusable, maintainable and testable code Writing unit tests<br><br>• Performing peer code reviews utilizing established team standards<br><br>• Part of an Agile team and contribute in daily stand-ups<br><br>• Comfortable leading discussions and cross-training other team members<br><br>Must have<br><br>• Should have minimum experience with 4 years of experience. Should have experience in developing web applications and a deep understanding of modern Python standards<br><br>• Proficiency with multiple Python Frameworks<br><br>• Proficiency in designing and building APIs<br><br>• Writing and consuming RESTful Web Services<br><br>• Strong knowledge of complex third party APIs integration(Payment Gateway, Banks)<br><br>Programming Concepts<br><br>• Experience in any frameworks like Django, FastApi etc.<br><br>• Basic knowledge of Node JS and Angular JS<br><br>• Expertise in JQuery, Ajax, prototype building and UI development<br><br>• Strong SQL skills in writing, optimizing and debugging complex queries<br><br>• Very good communication skills – oral and written<br><br>Interested candidates can apply to this job or share updated resume athrteam@wishfin.com<br>Apply for this Job<br><br>Full Name *<br><br>Phone *<br><br>Email *<br><br>Total Experience (in yrs.) *<br><br>Your Location *<br><br>Upload Resume * Format: Pdf, Doc, Docx with size",
      "link": "https://zobjobs.com/job/python-developer-job-in-canada-zj6qev4seoa4",
      "category": [
        "Python",
        "Python Developer",
        "Back End Developer"
      ],
      "location": "Canada CA",
      "country": "CA"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:10",
      "sourced": "public domain",
      "unique": 1388097,
      "companyName": "Gotham Technology Group",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Storage System Engineer",
      "description": "Title: Server Systems Engineer<br><br>Duration: 6+ months contract<br><br>Location: Hybrid onsite 3 days in NYC<br><br>Summary<br><br>The successful candidate will join our Servers, Storage and Database team as a consulting Systems Engineer to assist with security remediation backlog. The ideal candidate should have a minimum of 3 years of experience in the Financial industry with a solid knowledge of core infrastructure technologies such as Microsoft Operating systems, Virtualization (VMware), Networking, scripting and will poses excellent communication, coordination and documentation skills.<br><br>Virtualization Infrastructure<br>• Operational support for VMware environment as applicable to Server Support and security remediation Server Infrastructure<br>• Support for Windows server security remediation and patch management via SCCM (Windows 2012-2019)<br>• Support for application patching / security package deployment<br>• Experience working with Unix (RHEL) systems is preferred<br><br>Soft Skills<br>• Coordinate, schedule, track and remediate security issues with multiple team<br>• Security solution research based on active vulnerabilities and provisioning of the fix in a secure, safe and sustainable manner<br><br>Requirements<br>• 5+ years’ experience in overall IT<br>• Excellent communication skills<br>• Preferred Bachelor’s degree in Computer Science, MIS or a related field<br>• Ability to prioritize and execute tasks in a high-pressure environment, make sound decisions in emergency situations.<br>• Proven analytical and problem-solving abilities<br>• Experience working in a team-oriented, collaborative environment",
      "link": "https://zobjobs.com/job/storage-system-engineer-systems-engineer-job-in-usa-zj6qev4s7u6v",
      "category": [
        "Systems Engineer",
        "systems engineer"
      ],
      "location": "United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:10",
      "sourced": "public domain",
      "unique": 1388096,
      "companyName": "Unisys",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Senior System Engineer",
      "description": "Job title: Systems Engineer – Sr (PingFederate)<br><br>Hybrid<br><br>3 Months Contract<br><br>Location: New York, NY or McLean VA or Richmond VA<br><br>Note: PingFederate experience is mandatory ( Please apply & update resume )<br><br>Job Description:<br><br>PingFederate SME (Policy Management, Selectors,<br><br>Adapters, Access Token Management,Adapter Confi guration, etc),<br><br>SAML,<br><br>OpenID Connect,<br><br>SSO,<br><br>API (oAuth2.0)<br><br>Looking for SME<br><br>Strong Adapter, Adapter confirmation, Policy Management, Token Management and other tools)<br><br>SAML, Open ID Connect, SSO, API<br><br>IAM Security OAuth<br><br>API<br><br>Single Sign on Access token management<br><br>#LI-CGTS<br><br>#TS-4262",
      "link": "https://zobjobs.com/job/senior-system-engineer-systems-engineer-job-in-usa-zj6qev4s7rni",
      "category": [
        "Systems Engineer",
        "systems engineer"
      ],
      "location": "United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:10",
      "sourced": "public domain",
      "unique": 1388095,
      "companyName": "ClearanceJobs",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "System Engineer with Security Clearance",
      "description": "R-00128359 Description Are you ready to make an impact and join a creative, forward-thinking team? We’re looking for innovators and forward-thinkers to help us do great things. Leidos is seeking a System Engineer to join our Defense Enclave Services (DES) team to support our customer at Ft. Meade, MD; however, this position can be remote. POSITION SUMMARY: The Systems Engineer will deploy new Windows and Linux servers in Azure and provide support for maintaining and enhancing cloud infrastructure as well as the day-to-day maintenance support for troubleshooting Linux/Windows cloud systems and servers. This role requires an individual with technical expertise administering the full lifecycle of Linux and Windows platforms as code. The candidate will provide engineering support to develop automations for the building and patching Linux and Windows servers via Microsoft Intune, Red Hat Satellite and Ansible Automation Platform in support of new systems being deployed in Azure. This role is responsible for interacting with product owners across multiple sprint teams and working other engineers to troubleshooting problems for multiple systems and network environments. This role analyzes recurring problems and initiates solutions for preventing reoccurrence and analyzes existing infrastructure for tuning/performance enhancements. CLEARANCE REQUIREMENT:<br>• Must hold an active Secret security clearance. (US Citizenship required) PRIMARY RESPONSIBILITIES:<br>• Perform best practice engineering support for an environment Azure Cloud IaaS environment consisting of Linux and Windows Servers.<br>• Perform application packaging, deployments, documentation, and release control utilizing Jira/Jenkins and Ansible Automation Platform.<br>• Provide advice, technical consultation, and Tier 3/Tier 4 support guidance by analyzing and resolving problems and evaluating alternative means of satisfying user requirements.<br>• Engage in requirements gathering and validation with stakeholder groups and end users to understand and address current needs across server environments, as well as emerging/future trends.<br>• Research, test, and deploy security patches and vulnerability mitigation and remediation configuration changes.<br>• Provide support for the implementation, troubleshooting and maintenance of complex IT systems.<br>• Perform automation tasks through scripting and testing.<br>• Effectively support a blend of operational and test network engineering/administration activities.<br>• Create and maintain Standard Operating Procedures (SOPs) and technical documentation.<br>• Provide follow-up reports (technical findings, feedback, and resolution steps taken) for Root Cause Analysis and process improvement initiatives. BASIC QUALIFICATIONS:<br>• Bachelor’s degree and 8+ years of experience; additional years of directly applicable experience may be accepted in lieu of a degree.<br>• Experience building, configuring, patching and maintaining Windows/Linux Servers via Ansible or other automation platforms.<br>• Thorough understanding and/or experience with Azure Cloud Services or Amazon Cloud Services<br>• Knowledge of basic networking and network protocols (e.g. TCP/IP, routing, firewalls, SSH, VPNs)<br>• Hands-on experience with reviewing system logs and events to resolve issues.<br>• Develop and provide solutions to complex technical issues and problems that impact dev, test and production computing enclaves.<br>• Experienced with creating and managing critical system work instruction and Standard Operating Procedure documentation.<br>• Must be able to work independently to develop solutions to technical problems.<br>• Expertise in the Atlassian tool suite, to include JIRA and Confluence, or similar products such as Azure Dev Ops<br>• Excellent written and oral communication skills<br>• Must have a current IAT Level II or higher Certification such as Security +.<br><br>PREFERRED QUALIFICATIONS:<br>• Experience building and delivering IaaS servers and platforms via Infrastructure as Code.<br>• Experience Deploying and Scaling Azure Virtual Desktop Environments via Azure Functions or other automation platforms.<br>• Experience utilizing Azure Blueprints, Azure Functions and Ansible Automation Platform along with other Dev/Ops – CI/CD toolsets to deliver automation across multiple platforms and environments.<br>• Experience Deploying and maintaining complex infrastructure environments with Web Tier/Application Tier and Data Tier architectures.<br>• Recognized cloud certification, such as Amazon Web Services (AWS) Certified Solutions Architect, Cloud Certified Professional. DISADES External Referral Eligible Original Posting Date: 2024-02-06<br><br>While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above. Pay Range: Pay Range $87,100.00 - $157,450.00 The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law. #Remote Original Posting Date: 02/05/2024 While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above",
      "link": "https://zobjobs.com/job/system-engineer-with-security-clearance-systems-engineer-job-in-usa-zj6qev4s7o4i",
      "category": [
        "Systems Engineer",
        "systems engineer"
      ],
      "location": "United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:10",
      "sourced": "public domain",
      "unique": 1388094,
      "companyName": "Cynet Systems",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Cloud Systems Engineer",
      "description": "Job Description:<br><br>Pay Range $70hr - $80hr<br>• Required : Bachelors Degree in Computer Engineering, Computer Science with 10+ years of relevant experience.<br>• Good working project experience in cloud computing SaaS deployments ie, AWS/ Azure/GCP cloud Services.<br>• AWS preferred services include: Serverless, Databases, EKS, Cloud front, S3, Kafka.<br>• Ability to write and maintain code in languages like Bash, Ansible, Python, and Golang.<br>• Experience with AWS/Azure Infrastructure as Code with Terraform.<br>• 5 years of k8s experience including on-prem/cloud Kubernetes distributions.<br>• Hands-on experience with CICD especially with GitHub actions.<br>• Experience with Kubernetes configuration management with Helm.<br>• Experience with Kubernetes deployment strategy (blue/green, canary releases, GitOps).<br>• Experience with Istio and Kubernetes networking.<br>• Hands-on experience with Kubernetes native logging and monitoring stacks such as ELK/EFK, Prometheus/Grafana/Dynatrace.<br>• Experience managing production environments.<br>• Ability to analyze and solve complex issues spanning various topics.<br>• Proven ability working solo and with all company stakeholders",
      "link": "https://zobjobs.com/job/cloud-systems-engineer-job-in-usa-zj6qev4s7lqg",
      "category": [
        "Systems Engineer",
        "systems engineer"
      ],
      "location": "United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:08",
      "sourced": "public domain",
      "unique": 1388093,
      "companyName": "Leidos Inc",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "System Engineer",
      "description": "<p><b>Description</b> </p> <p><i><b>Are you ready to make an impact and join a creative, forward-thinking team? We're looking for innovators and forward-thinkers to help us do great things.</b></i></p><p></p><p>Leidos is seeking a<b> System Engineer</b> to join our Defense Enclave Services (DES) team to support our customer at Ft. Meade, MD; however, this position can be remote.</p><p><br><u><b>POSITION SUMMARY:</b></u><br>The Systems Engineer will deploy new Windows and Linux servers in Azure and provide support for maintaining and enhancing cloud infrastructure as well as the day-to-day maintenance support for troubleshooting Linux/Windows cloud systems and servers. This role requires an individual with technical expertise administering the full lifecycle of Linux and Windows platforms as code. The candidate will provide engineering support to develop automations for the building and patching Linux and Windows servers via Microsoft Intune, Red Hat Satellite and Ansible Automation Platform in support of new systems being deployed in Azure. This role is responsible for interacting with product owners across multiple sprint teams and working other engineers to troubleshooting problems for multiple systems and network environments. This role analyzes recurring problems and initiates solutions for preventing reoccurrence and analyzes existing infrastructure for tuning/performance enhancements.</p><p><br><u><b>CLEARANCE REQUIREMENT:</b></u><br>*Must hold an active Secret security clearance. (US Citizenship required)</p><p></p><p><u><b>PRIMARY RESPONSIBILITIES:</b></u><br>*Perform best practice engineering support for an environment Azure Cloud IaaS environment consisting of Linux and Windows Servers.<br>*Perform application packaging, deployments, documentation, and release control utilizing Jira/Jenkins and Ansible Automation Platform.<br>*Provide advice, technical consultation, and Tier 3/Tier 4 support guidance by analyzing and resolving problems and evaluating alternative means of satisfying user requirements.<br>*Engage in requirements gathering and validation with stakeholder groups and end users to understand and address current needs across server environments, as well as emerging/future trends.<br>*Research, test, and deploy security patches and vulnerability mitigation and remediation configuration changes.<br>*Provide support for the implementation, troubleshooting and maintenance of complex IT systems. <br>*Perform automation tasks through scripting and testing.<br>*Effectively support a blend of operational and test network engineering/administration activities.<br>*Create and maintain Standard Operating Procedures (SOPs) and technical documentation.<br>*Provide follow-up reports (technical findings, feedback, and resolution steps taken) for Root Cause Analysis and process improvement initiatives.</p><p><br><u><b>BASIC QUALIFICATIONS:</b></u><br>*Bachelor's degree and 8+ years of experience; additional years of directly applicable experience may be accepted in lieu of a degree.<br>*Experience building, configuring, patching and maintaining Windows/Linux Servers via Ansible or other automation platforms.<br>*Thorough understanding and/or experience with Azure Cloud Services or Amazon Cloud Services<br>*Knowledge of basic networking and network protocols (e.g. TCP/IP, routing, firewalls, SSH, VPNs)<br>*Hands-on experience with reviewing system logs and events to resolve issues.<br>*Develop and provide solutions to complex technical issues and problems that impact dev, test and production computing enclaves.<br>*Experienced with creating and managing critical system work instruction and Standard Operating Procedure documentation.<br>*Must be able to work independently to develop solutions to technical problems.<br>*Expertise in the Atlassian tool suite, to include JIRA and Confluence, or similar products such as Azure Dev Ops<br>*Excellent written and oral communication skills<br>*Must have a current IAT Level II or higher Certification such as Security +.<br><br><u><b>PREFERRED QUALIFICATIONS:</b></u><br>*Experience building and delivering IaaS servers and platforms via Infrastructure as Code.<br>*Experience Deploying and Scaling Azure Virtual Desktop Environments via Azure Functions or other automation platforms.<br>*Experience utilizing Azure Blueprints, Azure Functions and Ansible Automation Platform along with other Dev/Ops - CI/CD toolsets to deliver automation across multiple platforms and environments.<br>*Experience Deploying and maintaining complex infrastructure environments with Web Tier/Application Tier and Data Tier architectures.<br>*Recognized cloud certification, such as Amazon Web Services (AWS) Certified Solutions Architect, Cloud Certified Professional.</p><p></p><p>DISADES</p><p>External Referral Eligible</p><font class=\"bold\"></font><font class=\"bold\">Original Posting Date:</font>2024-02-06<p>While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.</p><p></p><font class=\"bold\">Pay Range:</font>Pay Range $87,100.00 - $157,450.00<p></p><p>The Leidos pay range for this job level is a general guideline onlyand not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.</p><p>#Remote<p></p><font class=\"bold\">Original Posting Date:</font>02/05/2024<p></p><p>While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.</p>",
      "link": "https://zobjobs.com/job/system-engineer-systems-engineer-job-in-usa-zj6qev4s22ft",
      "category": [
        "Systems Engineer",
        "systems engineer"
      ],
      "location": "Not specified United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:07",
      "sourced": "public domain",
      "unique": 1388092,
      "companyName": "AbbVie",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Systems Engineer - Medical Devices",
      "description": "The primary job function of this position is to act as a Systems Engineer for Parkinson’s Disease infusion systems products, working with little or no supervision. Will apply systems engineering knowledge and ingenuity to complete medium size projects from concept thru project closure within or across disciplines. Investigate, identify, develop, and optimize new methods and techniques to generate reliable and reproducible data in a timely manner. Read and adapt scientific/technical literature to accomplish assignments and demonstrate broad and versatile technical expertise within discipline.\n\nAdditional Responsibilities Include:\n\n• Shares responsibility for the sustaining systems engineering activities of infusion pumps.\n• Coordinates technical projects and engineering processes, while maintaining strict compliance to EU MDR and FDA regulations.\n• Performs testing or engineering analysis to understand behavior of components, sub-systems and interfaces.\n• Investigates, develops, and recommends alternatives for design, process, test methods, prototype generation or analysis for the optimal utilization and control of resources.\n• Performs system requirement analysis, functional analysis, and integration system testing.\n• Supports requirements (user needs, use case, system architect) development and maintenance. Assists/ supports the identification and implementation of product and process improvement. Develops and or manages infusion pumps system traceability matrix. \n• Independently designs and conducts critical experiments that further project goals. Implements and may innovate new experimental protocols/techniques. Understands the goal and maintains a high proficiency in his/her projects as well as the overall program.\n• Interprets results and draw conclusions from own multistage experiments, note significant deviations, then suggest, design, and pursue relevant experiments. Understands relevant scientific literature and applies theoretical framework to solving problems within scientific discipline in a timely manner. Performs routine and complex tasks competently and independently and generates reliable and consistent results.\n• Responsible for compliance with all applicable Corporate and Divisional policies and procedures. Understand and adhere to corporate standards regarding code of conduct, safety, appropriate handling of materials, controlled drug and radioactive compounds, GxP compliance, and animal care where applicable.\n• Compiles and evaluates design and test data, prepares technical specifications, and determines appropriate limits and variables for product, process, or materials specifications.\n• Attends all required training and complies with all responsibilities associated with the position, as detailed in Standard Operating Procedures.\n• Develops proposals for engineering projects and maintains the project’s budget.\n\n\nQualifications:\n\n• Bachelor’s Degree in Engineering or related discipline with five years of experience, or Master’s Degree or equivalent education with typically two years of experience. Advanced degrees preferred.\n• Candidates who had exposure to systems modeling, prototype generation and testing are preferred.\n• Interacts well with diverse groups within function and maintains strong working relationships with internal and external collaborators.\n\n\nAbbVie is committed to operating with integrity, driving innovation, transforming lives, serving our community, and embracing diversity and inclusion. It is AbbVie’s policy to employ qualified persons of the greatest ability without discrimination against any employee or applicant for employment because of race, color, religion, national origin, age, sex (including pregnancy), physical or mental disability, medical condition, genetic information, gender identity or expression, sexual orientation, marital status, status as a protected veteran, or any other legally protected group status.",
      "link": "https://zobjobs.com/job/systems-engineer-medical-devices-job-in-usa-zj6qev4rv7jo",
      "category": [
        "Systems Engineer",
        "systems engineer"
      ],
      "location": "North Chicago IL US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T02:03",
      "sourced": "public domain",
      "unique": 1388091,
      "companyName": "Randstad USA",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": ".NET Developer",
      "description": "job summary:<br>• Develops, enhances test, supports, maintains and debugs software applications that support business units or support functions. Required Skills<br><br>Angular, .Net Core, MS SQL Server<br><br>Desired Skills:<br><br>Agile methodology, JIRA, BitBucket<br>• Development and maintenance of .NET applications<br><br>Will be work with different teams (onshore and offshore) and within all levels of the organization<br><br>Effectively collaborate and share information with other colleagues<br><br>Adapt well with in a dynamic and changing environment<br><br>Good organizational and planning skills required<br><br>Demonstrated ability to prioritize and manage multiple tasks<br>location: Charlotte, North Carolina<br>job type: Contract<br>salary: $66.00 - 66.35 per hour<br>work hours: 8am to 4pm<br>education: Bachelors<br><br>responsibilities:<br>Responsibilities:<br><br>Development and maitenance of .NET applications<br><br>Will be work with different teams (onshore and offshore) and within all levels of the organization<br><br>Effectively collaborate and share information with other colleagues<br><br>Adapt well with in a dynamic and changing environment<br><br>Good organizational and planning skills required<br><br>Demonstrated ability to prioritize and manage multiple tasks<br>qualifications:<br>Experience level: Experienced<br><br>Education: Bachelors<br>skills: .NET<br><br>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<br><br>At Randstad Digital, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.<br><br>Pay offered to a successful candidate will be based on several factors including the candidates education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad Digital offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).<br><br>Applications accepted on ongoing basis until filled",
      "link": "https://zobjobs.com/job/net-developer-job-in-usa-zj6qev4rimrk",
      "category": [
        ".Net"
      ],
      "location": "United States US",
      "country": "US"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T01:59",
      "sourced": "public domain",
      "unique": 1388090,
      "companyName": "MGB Staffing Inc",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Software Developer - CRM",
      "description": "<div>Client:&nbsp;Ministry of Northern Development, Mines, Natural Resources and Forestry</div><div>Contract Length:&nbsp;13&nbsp;Months</div><div>Contract End Date:&nbsp;2025-03-31</div><div>Rate:&nbsp;$95/hr</div><div>Job Description:</div><div><div><div>\r\n<p data-aura-rendered-by=\"826:1121;a\"><strong>Must haves:</strong></p>\r\n<strong>Must haves:</strong>\r\n<ul data-aura-rendered-by=\"826:1121;a\"><li>Siebel Public Sector 8.x (10+ years) with 2+ year experience with Siebel IP2018+&nbsp;</li><li>Siebel data model (10+ years): Data model extension, EIM&nbsp;</li><li>Siebel Remote (10+ years): Docking Object, Siebel Anywhere&nbsp;</li><li>Siebel OpenUI (7+ years): PM/PR Scripting</li><li>Siebel Smart Scripts and Task Based UI (5+ years)&nbsp;</li><li>Siebel e-Services ( 10+ years)&nbsp;</li><li>Siebel EAI, EIM, BI Publisher Reports (10+ years)&nbsp;</li><li>Oracle Service Cloud (OSC)&nbsp;</li><li>Java™ Enterprise Edition (J2EE), Java™, JavaScript, jQuery, Jscript bootstrap framework, HTML 5, and CSS (5+ years)&nbsp;</li><li>REST web service (using JSON) (5+ years)&nbsp;</li></ul>\r\n<li>Siebel Public Sector 8.x (10+ years) with 2+ year experience with Siebel IP2018+&nbsp;</li>\r\n<li>Siebel data model (10+ years): Data model extension, EIM&nbsp;</li>\r\n<li>Siebel Remote (10+ years): Docking Object, Siebel Anywhere&nbsp;</li>\r\n<li>Siebel OpenUI (7+ years): PM/PR Scripting</li>\r\n<li>Siebel Smart Scripts and Task Based UI (5+ years)&nbsp;</li>\r\n<li>Siebel e-Services ( 10+ years)&nbsp;</li>\r\n<li>Siebel EAI, EIM, BI Publisher Reports (10+ years)&nbsp;</li>\r\n<li>Oracle Service Cloud (OSC)&nbsp;</li>\r\n<li>Java™ Enterprise Edition (J2EE), Java™, JavaScript, jQuery, Jscript bootstrap framework, HTML 5, and CSS (5+ years)&nbsp;</li>\r\n<li>REST web service (using JSON) (5+ years)&nbsp;</li>\r\n<p data-aura-rendered-by=\"826:1121;a\">&nbsp;</p>\r\n<p data-aura-rendered-by=\"826:1121;a\"><strong>Nice to have:</strong></p>\r\n<strong>Nice to have:</strong>\r\n<ul data-aura-rendered-by=\"826:1121;a\"><li>AODA, WCAG and Web accessibility</li><li>Public Sector Experience is an Asset</li></ul>\r\n<li>AODA, WCAG and Web accessibility</li>\r\n<li>Public Sector Experience is an Asset</li>\r\n</div>\r\n<div>\r\n<p data-aura-rendered-by=\"803:1121;a\"><strong style=\"color: black; font-size: 10pt;\">Evaluation Criteria:</strong></p><p data-aura-rendered-by=\"803:1121;a\"><span style=\"font-size: 10pt;\">&nbsp;</span></p><p data-aura-rendered-by=\"803:1121;a\"><strong style=\"color: black; font-size: 10pt;\">Solution Development Experience - 35%</strong></p><ul data-aura-rendered-by=\"803:1121;a\"><li><span style=\"color: black; font-size: 10pt;\">10+ years experience (including recent experience) solutioning and hands-on configuring complex Siebel Public Sector solutions including the use of integration with Siebel e-Services, Siebel Remote, Siebel EAI, EIM, SMARTScript, Web Services and Siebel BI Publisher</span></li><li><span style=\"color: black; font-size: 10pt;\">5+ years hands on experience in developing RESTful service with JSON</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years experience integrating with Single Sign On solutions like OID, ONe-Key, GO-PKI, and Public Secure</span></li><li><span style=\"color: black; font-size: 10pt;\">5+ hands on experience customizing Siebel Open UI and PM/PR scripting</span></li><li><span style=\"color: black; font-size: 10pt;\">5+ years hands-on developments experience with Siebel Smart Scripts and Task based UI</span></li><li><span style=\"color: black; font-size: 10pt;\">4+ years hands on experience with Jscript boostrap framework</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years experience developing unit testing scripts</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years setting up and developing solutions with multi-organization data structures and data visibility</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years experience configuring picklist and list -of-value (LOV) for multiple organizations and multiple languages</span></li><li><span style=\"color: black; font-size: 10pt;\">2+ years experience configuring in Siebel IP 20.x</span></li><li><span style=\"color: black; font-size: 10pt;\">5+ years experience developing integration using REST service</span></li><li><span style=\"color: black; font-size: 10pt;\">5+ years experience with developing unit testing scripts to confirm successful installation</span></li></ul><p data-aura-rendered-by=\"803:1121;a\"><span style=\"font-size: 10pt;\">&nbsp;</span></p><p data-aura-rendered-by=\"803:1121;a\"><strong style=\"color: black; font-size: 10pt;\">Technical Skills - 25%</strong></p><ul data-aura-rendered-by=\"803:1121;a\"><li><span style=\"color: black; font-size: 10pt;\">10+ years of demonstrated and hands on experience with Siebel Public Sector 8.x,&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years with Siebel data modelling and EIM</span></li><li><span style=\"color: black; font-size: 10pt;\">5+ years of hands on experience with Siebel OpenUI and PM/PR scripting</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years demonstrated and hands experience with Siebel e-services, Siebel EIM, BI Publisher reports, Javascript, HTML5 and CSS.&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">5+ years demonstrated and hands experience with the planning of ETL migrations of data from legacy solutions to the new Siebel solution using tools like EIM and development of custom data loaders&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years demonstrated and hands experience with Siebel EAI, Web Service, Data transformation and integration</span></li></ul><p data-aura-rendered-by=\"803:1121;a\"><span style=\"font-size: 10pt;\">&nbsp;</span></p><p data-aura-rendered-by=\"803:1121;a\"><strong style=\"color: black; font-size: 10pt;\">Installation, Design, Configuration, Integration and Troubleshooting - 20%&nbsp;</strong></p><ul data-aura-rendered-by=\"803:1121;a\"><li><span style=\"color: black; font-size: 10pt;\">10+ years of hands on experience installing, designing and configuring complex Siebel Public Sector systems including use of Siebel ADM, Oracle OID for single Sign on authentication and Siebel server to server encryption for high sensitive data.&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ experience troubleshooting and resolving issues of large complex Siebel Public Sector that including integration with several systems and use of Single sign-on.&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years of hands on experience in integrating Siebel Public Sector with non-Siebel systems like ESRI, Address Lookups (e.g Canada Post), SaaS solutions like Oracle Service Cloud and traditional middlewares like BizTalk</span></li><li><span style=\"color: black; font-size: 10pt;\">10+ years of hands on experience on development best practices and standards with Siebel Repository</span></li><li><span style=\"color: black; font-size: 10pt;\">5+ years of demonstrated and hands on experience on AODA, WCAG and assistive technologies</span></li><li><span style=\"color: black; font-size: 10pt;\">Experience and understanding of Workspace and parallel development</span></li><li><span style=\"color: black; font-size: 10pt;\">Experience with evaluating and documenting Siebel upgrade paths&nbsp;</span></li></ul><p data-aura-rendered-by=\"803:1121;a\"><span style=\"font-size: 10pt;\">&nbsp;</span></p><p data-aura-rendered-by=\"803:1121;a\"><strong style=\"color: black; font-size: 10pt;\">Methodologies, Documentation and Soft Skills - 20%</strong></p><ul data-aura-rendered-by=\"803:1121;a\"><li><span style=\"color: black; font-size: 10pt;\">Demonstrated knowledge and understanding of Oracle development methodologies, tools, and resources</span></li><li><span style=\"color: black; font-size: 10pt;\">Demonstrated experience with documentation of technical blueprints, build-books and procedure manuals</span></li><li><span style=\"color: black; font-size: 10pt;\">Experience with documenting processes and enhancement build books</span></li><li><span style=\"color: black; font-size: 10pt;\">Demonstrated ability to research and recommend Oracle tools and techniques that could be leveraged</span></li><li><span style=\"color: black; font-size: 10pt;\">Experience with developing prototype build books</span></li><li><span style=\"color: black; font-size: 10pt;\">Experience with documenting performance measures of the new environments</span></li><li><span style=\"color: black; font-size: 10pt;\">Experience working in an agile project delivery team</span></li><li><span style=\"color: black; font-size: 10pt;\">Excellent analytical, problem-solving and decision-making skills&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Strong collaboration skills&nbsp;with a proven track record for building strong working relationships&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">A demonstrated team player with a track record for meeting deadlines&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Strong verbal and written communication skills&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Strong communication skills to present technical designs/solutions to business clients</span></li></ul><p data-aura-rendered-by=\"803:1121;a\"><br></p><p data-aura-rendered-by=\"803:1121;a\"><span style=\"font-size: 10pt;\">&nbsp;</span></p><p data-aura-rendered-by=\"803:1121;a\"><strong style=\"color: black; font-size: 10pt;\">Must haves:</strong></p><ul data-aura-rendered-by=\"803:1121;a\"><li><span style=\"color: black; font-size: 10pt;\">Siebel Public Sector 8.x (10+ years) with 2+ year experience with Siebel IP2018+&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Siebel data model (10+ years): Data model extension, EIM&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Siebel Remote (10+ years): Docking Object, Siebel Anywhere&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Siebel OpenUI (7+ years): PM/PR Scripting</span></li><li><span style=\"color: black; font-size: 10pt;\">Siebel Smart Scripts and Task Based UI (5+ years)&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Siebel e-Services ( 10+ years)&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Siebel EAI, EIM, BI Publisher Reports (10+ years)&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Oracle Service Cloud (OSC)&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">Java™ Enterprise Edition (J2EE), Java™, JavaScript, jQuery, Jscript bootstrap framework, HTML 5, and CSS (5+ years)&nbsp;</span></li><li><span style=\"color: black; font-size: 10pt;\">REST web service (using JSON) (5+ years)&nbsp;</span></li></ul><p data-aura-rendered-by=\"803:1121;a\"><strong style=\"color: black; font-size: 10pt;\">Nice to have:</strong></p><p data-aura-rendered-by=\"803:1121;a\"><span style=\"color: black; font-family: Arial, sans-serif; font-size: 10pt;\">AODA, WCAG and Web accessibility</span></p><p data-aura-rendered-by=\"803:1121;a\"><br></p>\r\n</div></div></div>",
      "link": "https://zobjobs.com/job/software-developer-crm-javascript-job-in-canada-zj6qev4nc87u",
      "category": [
        "Javascript",
        "Software Developer"
      ],
      "location": "Toronto ON CA",
      "country": "CA"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T01:52",
      "sourced": "public domain",
      "unique": 1388089,
      "companyName": "eSynergy Solutions",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Node.js Developer - (Outside IR35)",
      "description": "Would a major public sector project building a digital service with Node.js and React be an exciting challenge for you?<br><br>esynergy are looking for a Node.js Developer to deliver a key project within a large UK government department, helping to build and deliver a successful digital service. Youll work closely with other development teams and with strong support from senior stakeholders, on a challenging project to make a true difference to this public sector organisation.<br><br>You will help to optimise data management, implement a task flow and enhanced search capabilities. This project aims to streamline the administrative procedure and automate the process of generating necessary documents.<br><br>Technical requirements: ✔️<br><br>Node.js<br><br>React<br><br>MongoDB<br><br>Git<br><br>Typescript<br><br>Docker<br><br>About us<br><br>esynergy is a technology consultancy and we build products, platforms and services to accelerate value for our clients.<br><br>We drive measurable impact that is tightly aligned to our clients’ business objectives. Put in practice that means high transparency, metric-driven reporting, and incremental handovers and a consistent focus on building our clients’ capability.<br><br>Our delivery teams are small and highly functional, formed by a vetted ecosystem of associates, luminaries and partners. We choose technologies that are the right fit for our clients’ needs and are not opinionated around specific tech stacks and service offerings.<br><br>Divisions<br><br>Associates Programme<br><br>Locations<br><br>London<br><br>Remote status<br><br>Hybrid Remote<br><br>Associate or Internal<br><br>Associate",
      "link": "https://zobjobs.com/job/nodejs-developer-outside-ir35-nodejs-job-in-uk-zj6qev4mn0mj",
      "category": [
        "nodejs"
      ],
      "location": "United Kingdom UK",
      "country": "GB"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T01:51",
      "sourced": "public domain",
      "unique": 1388088,
      "companyName": "eSynergy Solutions",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Node.js Developer - (Outside IR35)",
      "description": "<div><div><b><i>Would a major public sector project building a digital service with Node.js and React be an exciting challenge for you?</i></b></div><div></div><div><i><br>\ne</i><i>synergy are looking for a Node.js Developer to deliver a key project within a large UK government department, helping to build and deliver a successful digital service. You'll work closely with other development teams and with strong support from senior stakeholders, on a challenging project to make a true difference to this public sector organisation.</i></div><div><i>\nYou will help to optimise data management, implement a task flow and enhanced search capabilities. This project aims to streamline the administrative procedure and automate the process of generating necessary documents.</i></div><div></div><div><br>\nTechnical requirements: &#10004;&#65039;</div><ul>\n<div>Node.js</div>\n<div>React</div>\n<div>MongoDB</div>\n<div>Git</div>\n<div>Typescript</div>\n<div>Docker</div></ul><div></div><div><br>\nAbout us   </div><div><i>\nesynergy is a technology consultancy and we build products, platforms and services to accelerate value for our clients.</i><br>\n<br>\n<i>We drive measurable impact that is tightly aligned to our clients&rsquo; business objectives. Put in practice that means high transparency, metric-driven reporting, and incremental handovers and a consistent focus on building our clients&rsquo; capability.\n</i><br>\n<br>\n<i>Our delivery teams are small and highly functional, formed by a vetted ecosystem of associates, luminaries and partners. We choose technologies that are the right fit for our clients&rsquo; needs and are not opinionated around specific tech stacks and service offerings.</i></div></div>\n<br><div><div><div><div><b>Divisions</b></div>\n<div>Associates Programme\n</div><div><b>Locations</b></div>\n<div>London\n</div><div><b>Remote status</b></div>\n<div>Hybrid Remote\n</div><div><b>Associate or Internal</b></div>\n<div>Associate</div></div></div></div>",
      "link": "https://zobjobs.com/job/nodejs-developer-outside-ir35-nodejs-job-in-uk-zj6qev4mklit",
      "category": [
        "nodejs"
      ],
      "location": "London England UK",
      "country": "GB"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T01:46",
      "sourced": "public domain",
      "unique": 1388087,
      "companyName": "Finastra USA Corporation",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Senior Web Developer - Dotnet",
      "description": "Responsibilities<br><br>About the role:<br><br>Reporting to the Senior Manager, the Senior Developer designs, develops, analyzes, and maintains high-quality software product applications. This position is located in Mississauga but is remote for now.<br><br>What youll do:<br><br>Your deliverables as a Senior Developer will include, but are not limited to, the following:<br>• Participates in software design meetings and analyzes user needs to determine technical requirements.<br>• Designs and develops high-quality code.<br>• Tests, debugs, analyzes and fixes application problems/issues. Works closely with stakeholders to fix issues in a timely fashion.<br>• Follows the software development lifecycle process.<br>• Interacts with internal stakeholders to support product releases and/or resolve program problems.<br>• Other duties and projects as assigned.<br><br>What youll need:<br><br>Required Skills:<br>• 5+ years Software Development Experience<br>• .NET Core, Asp.net Core<br>• Angular, Microservices<br>• Asp. Net / MVC skillset<br>• Strong C skillset<br>• Microsoft Azure<br>• SQL (Either SQL SERVER T-SQL or Oracle PL/SQL)<br>• SSRS/ SSIS / Azure Data Factory<br>• HTML 5.0 (Ability to hand code)<br>• CSS, jQuery & JavaScript<br>• Entity Framework<br>• Web API<br>• A Sense of Ownership and Pride in work.<br><br>Nice to have skills:<br>• CRM Dynamics 365/PowerApps<br>• Extensive experience with design patterns.<br>• Dependency Injection<br>• Bootstrap<br>• DevOps experience moving Solutions from one environment to the other<br>• Microsoft Certification<br>• PowerBuilder or Java experience an asset.<br>• Good understanding of software performance optimization and metrics<br>• Hands-on experience with unit testing best practices and implementation<br>• Visual Studio TFS / GIT / Code Branching",
      "link": "https://zobjobs.com/job/senior-web-developer-dotnet-net-job-in-canada-zj6qev4m5j01",
      "category": [
        ".NET"
      ],
      "location": "Canada CA",
      "country": "CA"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T01:45",
      "sourced": "public domain",
      "unique": 1388086,
      "companyName": "Finastra USA Corporation",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Senior Microsoft 365 Developer",
      "description": "<div>Responsibilities:\n<p><b>\nWhat will you contribute?</b></p><p><br>\nReporting to the <b>Developer Manager</b>, the <b>Senior Software Engineer </b>designs, develops, analyzes, and maintains high-quality software product applications.</p><p></p><p><b>\nResponsibilities & Deliverables:</b><br>\n<br>\nYour deliverables as a <b>Senior Software Engineer</b> will include, but are not limited to, the following:</p><ul><li>\nParticipates in software design meetings and analyzes user needs to determine technical requirements.</li><li>\nDesigns and develops high-quality code.</li><li>\nTests, debugs, analyzes and fixes application problems/issues. Works closely with stakeholders to fix issues in a timely fashion.</li><li>\nFollows the software development lifecycle process.</li><li>\nInteracts with internal stakeholders to support product releases and/or resolve program problems.</li><li>\nOther duties and projects as assigned.</li></ul><p></p><p><b>\nRequired Experience:</b></p><ul><li><b>\n5</b> years&rsquo; software development experience including design and development.</li><li>\nExperience with C#, JavaScript, VB, PowerShell, Angular, Azure PaaS preferred.</li><li>\nFamiliarity with RESTful APIs, HTML, CSS, SQL preferred.</li><li>\nFinancial industry experience preferred.</li><li>\nProficiency with Microsoft Office applications.</li><li>\nKnowledge of software development methodologies and the software development lifecycle.</li><li>\nAbility to provide solutions to a variety of technical problems of moderate scope and complexity independently.</li><li>\nStrong technical, analytical, and development skills.</li><li>\nIntermediate knowledge of required programming languages.</li><li>\nEffective verbal and written communication skills; effective customer service skills.</li><li>\nAbility to work independently or within a team environment and handle multiple projects simultaneously.</li></ul></div>",
      "link": "https://zobjobs.com/job/senior-microsoft-365-developer-net-job-in-canada-zj6qev4m1hu6",
      "category": [
        ".NET"
      ],
      "location": "Mississauga Ontario CA",
      "country": "CA"
    },
    {
      "created": "2024-02-09T02:23:52+00:00",
      "expires": "2024-03-07T01:45",
      "sourced": "public domain",
      "unique": 1388085,
      "companyName": "Finastra USA Corporation",
      "companyUrl": "https://zobjobs.com/company/false",
      "title": "Senior Web Developer",
      "description": "<br><strong>Responsibilities</strong><br><br><p><b>About the role:</b></p><p>Reporting to the Senior Manager, the Senior Developer designs, develops, analyzes, and maintains high-quality software product applications.&nbsp;</p><p></p><p><b>What you'll do:</b></p><p>Your deliverables as a Senior Developer will include, but are not limited to, the following:</p><ul><li>Participates in software design meetings and analyzes user needs to determine technical requirements.</li><li>Designs and develops high-quality code.</li><li>Tests, debugs, analyzes and fixes application problems/issues.&nbsp;&nbsp; Works closely with stakeholders to fix issues in a timely fashion.</li><li>Follows the software development lifecycle process.</li><li>Interacts with internal stakeholders to support product releases and/or resolve program problems.</li><li>Other duties and projects as assigned.</li></ul><p></p><p><b>What you'll need:</b></p><p><b>Required Skills:</b></p><ul><li>5+ years Software Development Experience</li><li>.NET Core, Asp.net Core</li><li>Angular, Microservices</li><li>Asp. Net / MVC skillset</li><li>Strong C# skillset</li><li>Microsoft Azure</li><li>SQL (Either SQL SERVER T-SQL or Oracle PL/SQL)</li><li>SSRS/ SSIS / Azure Data Factory</li><li>HTML 5.0 (Ability to hand code)</li><li>CSS, jQuery & JavaScript</li><li>Entity Framework</li><li>Web API</li><li>A Sense of Ownership and Pride in work.</li></ul><p></p><p><b>Nice to have skills:</b></p><ul><li>CRM Dynamics 365/PowerApps</li><li>Extensive experience with design patterns.</li><li>Dependency Injection</li><li>Bootstrap</li><li>DevOps experience moving Solutions from one environment to the other</li><li>Microsoft Certification</li><li>PowerBuilder or Java experience an asset.</li><li>Good understanding of software performance optimization and metrics</li><li>Hands-on experience with unit testing best practices and implementation</li><li>Visual Studio TFS / GIT / Code Branching</li></ul><p></p>",
      "link": "https://zobjobs.com/job/senior-web-developer-net-job-in-canada-zj6qev4m10od",
      "category": [
        ".NET"
      ],
      "location": "Mississauga Ontario Canada CA",
      "country": "CA"
    }
  ]
}